Infineon/IMR_PSoC6_BMS/proj_cm0p/PSoC6_BMS_EPD_ScreenConfig.c
/*
 * PSoC6_BMS_EPD_ScreenConfigs.c - E-Ink display menu settings and definition
 *
 *  Created on: 07.07.2023
 *      Author: m. schmidt and r. santeler
 *
*******************************************************************************
 * (c) (2024), Cypress Semiconductor Corporation (an Infineon company) or an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 * This software, including source code, documentation and related materials ("Software") is owned by Cypress Semiconductor Corporation or one of its affiliates ("Cypress") and is protected by and subject to worldwide patent protection (United States and foreign), United States copyright laws and international treaty provisions.  Therefore, you may use this Software only as provided in the license agreement accompanying the software package from which you obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive, non-transferable license to copy, modify, and compile the Software source code solely for use in connection with Cypress's integrated circuit products.  Any reproduction, modification, translation, compilation, or representation of this Software except as specified above is prohibited without the express written permission of Cypress.
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress reserves the right to make changes to the Software without notice. Cypress does not assume any liability arising out of the application or use of the Software or any product or circuit described in the Software. Cypress does not authorize its products for use in any products where a malfunction or failure of the Cypress product may reasonably be expected to result in significant property damage, injury or death ("High Risk Product"). By including Cypress's product in a High Risk Product, the manufacturer of such system or application assumes all risk of such use and in doing so agrees to indemnify Cypress against all liability.
*******************************************************************************/

#include <PSoC6_BMS_EPD_ScreenConfig.h>
#include "ram_public.h"
#include "ipc_def.h"

/*******************************************************************************
* Macros
*******************************************************************************/
#define CELL_SOC_LOWER 		2.8	// The cell state symbol is printed mapping the cell voltage between CELL_SOC_LOWER and CELL_SOC_UPPER
#define CELL_SOC_UPPER 		4.2
#define MAX_SHOWN_ERRORS 	3   // Maximum number of errors that can be shown on display

/*******************************************************************************
* Function Prototypes
*******************************************************************************/
uint8_t print_DispErrors(uint32_t error_map, uint8_t numErrors, uint8_t maxErrorsPerLine);
uint8_t countSetBits(uint32_t n);
float mapRangeToScale(float n, float lRange, float hRange, float scale);

/*******************************************************************************
* Global Variables
*******************************************************************************/
/* Shadow buffer for public variables*/

extern uint32_t		 sh_pub_error_map_cm0;
extern uint8_t 	 	 sh_pub_soc_cm0;
extern uint8_t 	 	 sh_pub_soh_cm0;
extern uint16_t 	 sh_pub_volt_cm0;
extern int16_t 	 	 sh_pub_current_cm0;
extern outputStates  sh_pub_outputState_cm0;
extern slotStates 	 sh_pub_slotState_cm0;
extern uint16_t 	 sh_pub_cells_cm0[NUM_CELLS];

uint16_t Full_SOC = 99;
uint16_t Full_SOH = 99;
uint16_t Full_Volt = 44200;
uint16_t Full_Current = 980;

EPD_E2200CS021_status_t EPD_Status_Obj = { 	.Active_Hours = 0,
											.Active_Minutes = 0,
											.Active_Seconds = 254,
											.OUTPUT_Status = OUTPUT_READY,
											.SLOT_Status = SLOT_NONE,
											.error_map = 0,
											.soc = 0,
											.soh = 0,
											.voltage_data = 0,
											.current_data = 0};

uint16_t Cell_SOC[NUM_CELLS] = { 	8, 20, 30, 40, 100, 100,
											75, 78, 31, 45, 76, 8};
uint16_t Cell_Volt[NUM_CELLS] = { 	3750, 4120, 2950, 3910, 2094, 1029,
											3049, 1092, 4180, 3600, 3832, 2930};

cyhal_spi_t spi;	/* HAL SPI object to interface with display driver */
EPD_E2200CS021_pages_t current_page = 0;

uint8_t *current_frame;		/* Pointer to the new frame that need to be written */
uint8_t previous_frame[PV_EINK_IMAGE_SIZE] = { 0 };		/* Buffer to the previous frame written on the display */

const mtb_e2200cs021_pins_t pins = {		/* Configuration structure defining the necessary pins to communicate with the E-ink display */
    .spi_mosi 	= EPD_PIN_DISPLAY_SPI_MOSI,
    .spi_miso 	= EPD_PIN_DISPLAY_SPI_MISO,
    .spi_sclk 	= EPD_PIN_DISPLAY_SPI_SCLK,
    .spi_cs 	= EPD_PIN_DISPLAY_CS,
    .reset 		= EPD_PIN_DISPLAY_RST,
    .busy 		= EPD_PIN_DISPLAY_BUSY,
    .discharge 	= EPD_PIN_DISPLAY_DISCHARGE,
    .enable 	= EPD_PIN_DISPLAY_EN
};

/*******************************************************************************
* Function Definitions
*******************************************************************************/
void Initialize_EPD(int8_t displayTempFactor) {
    /* Initialize SPI and EINK display */
    cy_rslt_t result = cyhal_spi_init(&spi, EPD_PIN_DISPLAY_SPI_MOSI,
            								EPD_PIN_DISPLAY_SPI_MISO,
											EPD_PIN_DISPLAY_SPI_SCLK,
											NC, NULL, 8, CYHAL_SPI_MODE_00_MSB, false);

    if (CY_RSLT_SUCCESS == result) {
        result = cyhal_spi_set_frequency(&spi, EPD_SPI_BAUDRATE_HZ);

        if (CY_RSLT_SUCCESS == result) {
            result = mtb_e2200cs021_init(&pins, &spi);

            mtb_e2200cs021_set_temp_factor(displayTempFactor);	/* Set ambient temperature, in degree C, in order to perform temperature compensation of E-INK parameters */
            current_frame = (uint8_t*) LCD_GetDisplayBuffer();

            GUI_Init();		/* Initialize EmWin driver*/
            //first_screen_update();

            //vTaskDelay(DELAY_AFTER_STARTUP_SCREEN_MS);
            //cyhal_system_delay_ms(DELAY_AFTER_STARTUP_SCREEN_MS);
        }
    }
}

/******************************************************************************/
void first_screen_update(void) {
    current_page = show_page(EPD_MainScreen);

    /* Update the display */
    mtb_e2200cs021_show_frame(previous_frame, current_frame,
                              MTB_E2200CS021_FULL_4STAGE, true);
}


/******************************************************************************/
void clear_screen(void) {
    GUI_SetColor(GUI_BLACK);
    GUI_SetBkColor(GUI_WHITE);
    GUI_Clear();
}

/******************************************************************************/
void show_top_legend(char legend_name[], EPD_E2200CS021_pages_t page) {
	/* Set foreground and background color and font size */
	GUI_SetFont(GUI_FONT_10_1);
	GUI_SetColor(GUI_BLACK);
	GUI_SetBkColor(GUI_WHITE);
	GUI_FillRect(0, 0, MTB_E2200CS021_DISPLAY_SIZE_X, TOP_LEGEND_HEIGHT);

	GUI_SetColor(GUI_WHITE);
	GUI_SetBkColor(GUI_BLACK);
	GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
	GUI_DispStringAt(legend_name, 6, (TOP_LEGEND_HEIGHT / 2));
	GUI_SetTextAlign(GUI_TA_RIGHT | GUI_TA_VCENTER);
    GUI_DispStringAt("PAGE    /    ", MTB_E2200CS021_DISPLAY_SIZE_X, (TOP_LEGEND_HEIGHT / 2));
    GUI_DispDecAt((page + 1), MTB_E2200CS021_DISPLAY_SIZE_X - 22, (TOP_LEGEND_HEIGHT / 2), 1);
    GUI_DispDecAt(TOTAL_PAGE_COUNT, MTB_E2200CS021_DISPLAY_SIZE_X - 10, (TOP_LEGEND_HEIGHT / 2), 1);
}

/******************************************************************************/
void show_battery_page(uint16_t start_battery, uint16_t battery_voltage_data[]) {
	GUI_SetColor(GUI_BLACK);
	GUI_SetBkColor(GUI_WHITE);

	GUI_SetFont(GUI_FONT_13B_1);
	uint8_t Pos_Counter = 1;
	for (uint8_t i = start_battery; (i <= NUM_CELLS) && (Pos_Counter <= BATTERY_PER_PAGE); i++) {
		// Determine diagnostic, cell voltage and mapped SoC
		uint16_t cell_diagnotic_state = battery_voltage_data[i - 1] & CELL_DIAGNOSTIC_STATES_MAP;
		float cell_voltage    = (float)(battery_voltage_data[i - 1] & CELL_VOLTAGE_MAP) / 1000.0;
		Cell_SOC[i - 1] = (uint16_t)mapRangeToScale(cell_voltage, CELL_SOC_LOWER, CELL_SOC_UPPER, 100.0);

		// Print cell SoC
		GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
	    GUI_DispDecAt(i,	BATTERY_CENTER_LOCATION_X * Pos_Counter - BATTERY_SYMBOL_SIZE_X + 4,
	    					BATTERY_TEXT_TOP_LOCATION, 2);

