Infineon/IMR_PSoC6_BMS/proj_cm0p/PSoC6_BMS_EPD_ScreenConfig.c
	    GUI_DrawRect(	BATTERY_CENTER_LOCATION_X * Pos_Counter - (BATTERY_SYMBOL_SIZE_X / 2) - BATTERY_SYMBOL_HEAD_SIZE,
	    				MTB_E2200CS021_DISPLAY_SIZE_Y_HALF - (BATTERY_SYMBOL_SIZE_Y / 2) - 2,
						BATTERY_CENTER_LOCATION_X * Pos_Counter - (BATTERY_SYMBOL_SIZE_X / 2) + BATTERY_SYMBOL_HEAD_SIZE,
						MTB_E2200CS021_DISPLAY_SIZE_Y_HALF - (BATTERY_SYMBOL_SIZE_Y / 2) - 1);

	    GUI_DrawRoundedRect(BATTERY_CENTER_LOCATION_X * Pos_Counter - BATTERY_SYMBOL_SIZE_X + BATTERY_SYMBOL_SIZE_BORDER,
	    					MTB_E2200CS021_DISPLAY_SIZE_Y_HALF - (BATTERY_SYMBOL_SIZE_Y / 2),
							BATTERY_CENTER_LOCATION_X * Pos_Counter - BATTERY_SYMBOL_SIZE_BORDER,
							MTB_E2200CS021_DISPLAY_SIZE_Y_HALF + (BATTERY_SYMBOL_SIZE_Y / 2), 2);

	    if (Cell_SOC[i - 1] >= 10) {
	    	GUI_FillRoundedRect(BATTERY_CENTER_LOCATION_X * Pos_Counter - BATTERY_SYMBOL_SIZE_X + BATTERY_SYMBOL_SIZE_BORDER + BATTERY_SYMBOL_SIZE_BORDER,
	    						MTB_E2200CS021_DISPLAY_SIZE_Y_HALF + (BATTERY_SYMBOL_SIZE_Y / 2) - (BATTERY_SYMBOL_SIZE_Y / 5),
								BATTERY_CENTER_LOCATION_X * Pos_Counter - BATTERY_SYMBOL_SIZE_BORDER - BATTERY_SYMBOL_SIZE_BORDER,
								MTB_E2200CS021_DISPLAY_SIZE_Y_HALF + (BATTERY_SYMBOL_SIZE_Y / 2) - BATTERY_SYMBOL_SIZE_BORDER, 2);
	    }
	    if (Cell_SOC[i - 1] >= 30) {
			GUI_FillRoundedRect(BATTERY_CENTER_LOCATION_X * Pos_Counter - BATTERY_SYMBOL_SIZE_X + BATTERY_SYMBOL_SIZE_BORDER + BATTERY_SYMBOL_SIZE_BORDER,
								MTB_E2200CS021_DISPLAY_SIZE_Y_HALF + (BATTERY_SYMBOL_SIZE_Y / 2) - (BATTERY_SYMBOL_SIZE_Y / 5) * 2,
								BATTERY_CENTER_LOCATION_X * Pos_Counter - BATTERY_SYMBOL_SIZE_BORDER - BATTERY_SYMBOL_SIZE_BORDER,
								MTB_E2200CS021_DISPLAY_SIZE_Y_HALF + (BATTERY_SYMBOL_SIZE_Y / 2) - (BATTERY_SYMBOL_SIZE_Y / 5) - BATTERY_SYMBOL_SIZE_BORDER, 2);
	    }
	    if (Cell_SOC[i - 1] >= 50) {
			GUI_FillRoundedRect(BATTERY_CENTER_LOCATION_X * Pos_Counter - BATTERY_SYMBOL_SIZE_X + BATTERY_SYMBOL_SIZE_BORDER + BATTERY_SYMBOL_SIZE_BORDER,
								MTB_E2200CS021_DISPLAY_SIZE_Y_HALF + (BATTERY_SYMBOL_SIZE_Y / 2) - (BATTERY_SYMBOL_SIZE_Y / 5) * 3,
								BATTERY_CENTER_LOCATION_X * Pos_Counter - BATTERY_SYMBOL_SIZE_BORDER - BATTERY_SYMBOL_SIZE_BORDER,
								MTB_E2200CS021_DISPLAY_SIZE_Y_HALF + (BATTERY_SYMBOL_SIZE_Y / 2) - (BATTERY_SYMBOL_SIZE_Y / 5) * 2 - BATTERY_SYMBOL_SIZE_BORDER, 2);
	    }
	    if (Cell_SOC[i - 1] >= 70) {
			GUI_FillRoundedRect(BATTERY_CENTER_LOCATION_X * Pos_Counter - BATTERY_SYMBOL_SIZE_X + BATTERY_SYMBOL_SIZE_BORDER + BATTERY_SYMBOL_SIZE_BORDER,
								MTB_E2200CS021_DISPLAY_SIZE_Y_HALF + (BATTERY_SYMBOL_SIZE_Y / 2) - (BATTERY_SYMBOL_SIZE_Y / 5) * 4,
								BATTERY_CENTER_LOCATION_X * Pos_Counter - BATTERY_SYMBOL_SIZE_BORDER - BATTERY_SYMBOL_SIZE_BORDER,
								MTB_E2200CS021_DISPLAY_SIZE_Y_HALF + (BATTERY_SYMBOL_SIZE_Y / 2) - (BATTERY_SYMBOL_SIZE_Y / 5) * 3 - BATTERY_SYMBOL_SIZE_BORDER, 2);
	    }
	    if (Cell_SOC[i - 1] >= 90) {
			GUI_FillRoundedRect(BATTERY_CENTER_LOCATION_X * Pos_Counter - BATTERY_SYMBOL_SIZE_X + BATTERY_SYMBOL_SIZE_BORDER + BATTERY_SYMBOL_SIZE_BORDER,
								MTB_E2200CS021_DISPLAY_SIZE_Y_HALF + (BATTERY_SYMBOL_SIZE_Y / 2) - (BATTERY_SYMBOL_SIZE_Y / 5) * 5,
								BATTERY_CENTER_LOCATION_X * Pos_Counter - BATTERY_SYMBOL_SIZE_BORDER - BATTERY_SYMBOL_SIZE_BORDER,
								MTB_E2200CS021_DISPLAY_SIZE_Y_HALF + (BATTERY_SYMBOL_SIZE_Y / 2) - (BATTERY_SYMBOL_SIZE_Y / 5) * 4 - BATTERY_SYMBOL_SIZE_BORDER, 2);
	    }

	    // Print cell diagnostic
	    GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
	    GUI_GotoXY(	BATTERY_CENTER_LOCATION_X * Pos_Counter - (BATTERY_SYMBOL_SIZE_X / 2) , 	BATTERY_TEXT_BOT_LOCATION_1);// - 6
	    //GUI_DispDecSpace(Cell_SOC[i - 1], 3);
	    //GUI_DispString("%");
	    if(cell_diagnotic_state == CELL_DIAG_OPEN_LOOP)
	    	GUI_DispString("OL");
	    else if(cell_diagnotic_state == CELL_DIAG_UNDERVOLTAGE)
	    	GUI_DispString("UV");
	    else if(cell_diagnotic_state == CELL_DIAG_OVERVOLTAGE)
	    	GUI_DispString("OV");
	    else if(cell_diagnotic_state == CELL_DIAG_BAL_UNDERVOLTAGE)
	    	GUI_DispString("BUV");
	    else if(cell_diagnotic_state == CELL_DIAG_BAL_OVERVOLTAGE)
	    	GUI_DispString("BOV");
	    else if(cell_diagnotic_state == CELL_DIAG_IS_BALANCING)
	    	GUI_DispString("BAL");
	    else
	    	GUI_DispString(" ");

	    // Print cell voltage
	    GUI_SetTextAlign(GUI_TA_HCENTER | GUI_TA_VCENTER);
	    GUI_GotoXY(	BATTERY_CENTER_LOCATION_X * Pos_Counter - (BATTERY_SYMBOL_SIZE_X / 2) - 2, 	BATTERY_TEXT_BOT_LOCATION_2);
	    GUI_DispFloatMin(cell_voltage, 2);
	    GUI_DispString("V");
	    Pos_Counter++;
	}
}

/******************************************************************************/
void show_main_page(EPD_E2200CS021_status_t status) {
	static uint8_t executionCounter;

	/* Draw Top - Show Up-Time for Charging/Discharging */
	GUI_SetColor(GUI_BLACK);
	GUI_SetBkColor(GUI_WHITE);

	GUI_SetFont(GUI_FONT_24B_1);
    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_GotoXY(	MAIN_SYMBOL_SIZE_BORDER, MAIN_TEXT_TOP_LOCATION_1);

    switch(status.OUTPUT_Status) {
        	case OUTPUT_OFF:
        	   	GUI_DispString("OFF");
        	   	break;
        	case OUTPUT_READY:
            	GUI_DispString("READY");
            	break;
            case OUTPUT_OFF_TILL_RESTART:
            	GUI_DispString("INACTIVE");
            	break;
            case OUTPUT_PRECHARGE:
            	GUI_DispString("PRECHARGE");
            	break;
        	case OUTPUT_ON:
        	    GUI_DispDec(status.Active_Hours, 2);
        	    GUI_DispString(":");
        	    GUI_DispDec(status.Active_Minutes, 2);
        	    GUI_DispString(":");
        	    GUI_DispDec(status.Active_Seconds, 2);
            	break;
    }

	/* Draw First Information Line - Show Battery SOC & SOH */
	GUI_SetFont(GUI_FONT_16B_1);
    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_GotoXY(	MAIN_SYMBOL_SIZE_BORDER, 	MAIN_TEXT_BOT_LOCATION_1);
    GUI_DispString("SOC:");

    GUI_GotoXY(	MTB_E2200CS021_DISPLAY_SIZE_X_QUARTER + 10, 	MAIN_TEXT_BOT_LOCATION_1);
    GUI_SetTextAlign(GUI_TA_RIGHT | GUI_TA_VCENTER);
    GUI_DispDecSpace(status.soc, 3);

