Infineon/IMR_PSoC6_BMS/proj_cm0p/PSoC6_BMS_EPD_ScreenConfig.c
    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_DispString("%  ");
    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_DispString("SOH:");

	GUI_GotoXY(	MTB_E2200CS021_DISPLAY_SIZE_X_HALF + 33, 	MAIN_TEXT_BOT_LOCATION_1);
	GUI_SetTextAlign(GUI_TA_RIGHT | GUI_TA_VCENTER);
    if(status.soh >= 99){
    	GUI_DispString("100");
    }
    else if(status.soh < 50){
    	GUI_DispString("<50");
    }
    else {
    	// Show SoH in steps of 5
		//if(status.soh < 60) GUI_DispString(">55");
		//else if(status.soh < 65) GUI_DispString(">60");
		//else if(status.soh < 70) GUI_DispString(">65");
		//else if(status.soh < 75) GUI_DispString(">70");
		//else if(status.soh < 80) GUI_DispString(">75");
		//else if(status.soh < 85) GUI_DispString(">80");
		//else if(status.soh < 90) GUI_DispString(">85");
		//else if(status.soh < 95) GUI_DispString(">90");
		//else GUI_DispString(">95");

    	// Show SoH in steps of 10
    	if(status.soh < 60) GUI_DispString(">50");
		else if(status.soh < 70) GUI_DispString(">60");
		else if(status.soh < 80) GUI_DispString(">70");
		else if(status.soh < 90) GUI_DispString(">80");
    	else GUI_DispString(">90");
    }


    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_DispString("%   ");

	/* Draw Second Information Line - Show Battery Voltage*/
	GUI_SetFont(GUI_FONT_16B_1);
    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_GotoXY(	MAIN_SYMBOL_SIZE_BORDER, 	MAIN_TEXT_BOT_LOCATION_2);
    GUI_DispString("Voltage:");

    GUI_SetTextAlign(GUI_TA_RIGHT | GUI_TA_VCENTER);
    GUI_GotoXY(	MTB_E2200CS021_DISPLAY_SIZE_X_HALF, 	MAIN_TEXT_BOT_LOCATION_2);
    GUI_DispFloatMin((float) status.voltage_data / 1000, 2);

    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_DispString(" V");

	/* Draw Third Information Line - Show Battery Current Or Error Code */
	GUI_SetFont(GUI_FONT_16B_1);
    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_GotoXY(	MAIN_SYMBOL_SIZE_BORDER, 	MAIN_TEXT_BOT_LOCATION_3);
    if(sh_pub_error_map_cm0 == 0){
		GUI_DispString("Current:");

		GUI_SetFont(GUI_FONT_16B_1);
		GUI_SetTextAlign(GUI_TA_RIGHT | GUI_TA_VCENTER);
		GUI_GotoXY(	MTB_E2200CS021_DISPLAY_SIZE_X_HALF, 	MAIN_TEXT_BOT_LOCATION_3);
		//////GUI_DispDecSpace(current_data, 3);
		GUI_DispFloatMin((float) status.current_data / 1000, 2);
		//GUI_DispString("-");

		GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
		GUI_DispString(" A");
    }
    else{
    	// Display error strings 2 out of 3 the times, the 3rd time show the error code
    	uint8_t numErrors = countSetBits(status.error_map);
    	if(((executionCounter % 3) == 0) && (numErrors > MAX_SHOWN_ERRORS)){
    		GUI_DispString("Error: 0x");
    		GUI_DispHex(status.error_map, 8);
    	}
    	else{
    		GUI_DispString("Error: ");
			print_DispErrors(status.error_map, numErrors, MAX_SHOWN_ERRORS);
    	}
    }

	/* Draw Fourth Information Line - Show Battery Voltage & Current Draw */
	GUI_SetFont(GUI_FONT_16B_1);
    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_GotoXY(	MAIN_SYMBOL_SIZE_BORDER, 	MAIN_TEXT_BOT_LOCATION_4);
    GUI_DispString("Slot:");

    switch(status.SLOT_Status) {
        	case SLOT_NONE:
        	   	GUI_DispString(" ---");
        	   	break;
        	case SLOT_IN_SYSTEM_1:
            	GUI_DispString(" System 1");
            	break;
        	case SLOT_IN_SYSTEM_2:
            	GUI_DispString(" System 2");
            	break;
        	case SLOT_IN_CHARGER:
            	GUI_DispString(" Charger");
            	break;
    }

    GUI_FillRect(	MTB_E2200CS021_DISPLAY_SIZE_X - (MAIN_SYMBOL_SIZE_X / 2) - MAIN_SYMBOL_SIZE_BORDER - MAIN_SYMBOL_HEAD_SIZE,
		   	   	   	MTB_E2200CS021_DISPLAY_SIZE_Y_HALF + TOP_LEGEND_HEIGHT - (MAIN_SYMBOL_SIZE_Y / 2) - MAIN_SYMBOL_SIZE_BORDER - 2,
					MTB_E2200CS021_DISPLAY_SIZE_X - (MAIN_SYMBOL_SIZE_X / 2) - MAIN_SYMBOL_SIZE_BORDER + MAIN_SYMBOL_HEAD_SIZE,
					MTB_E2200CS021_DISPLAY_SIZE_Y_HALF + TOP_LEGEND_HEIGHT - (MAIN_SYMBOL_SIZE_Y / 2) - MAIN_SYMBOL_SIZE_BORDER - 1);

	GUI_DrawRoundedRect(	MTB_E2200CS021_DISPLAY_SIZE_X - MAIN_SYMBOL_SIZE_X - MAIN_SYMBOL_SIZE_BORDER,
							MTB_E2200CS021_DISPLAY_SIZE_Y_HALF + TOP_LEGEND_HEIGHT - MAIN_SYMBOL_SIZE_BORDER - (MAIN_SYMBOL_SIZE_Y / 2),
							MTB_E2200CS021_DISPLAY_SIZE_X - MAIN_SYMBOL_SIZE_BORDER,
							MTB_E2200CS021_DISPLAY_SIZE_Y_HALF + TOP_LEGEND_HEIGHT + (MAIN_SYMBOL_SIZE_Y / 2), 2);

    if (status.soc >= 10) {
    	GUI_FillRoundedRect(MTB_E2200CS021_DISPLAY_SIZE_X - MAIN_SYMBOL_SIZE_X,
    						MTB_E2200CS021_DISPLAY_SIZE_Y - MAIN_SYMBOL_SIZE_BORDER - (MAIN_SYMBOL_SIZE_Y / 5),
							MTB_E2200CS021_DISPLAY_SIZE_X - MAIN_SYMBOL_SIZE_BORDER - MAIN_SYMBOL_SIZE_BORDER,
							MTB_E2200CS021_DISPLAY_SIZE_Y - MAIN_SYMBOL_SIZE_BORDER - MAIN_SYMBOL_SIZE_BORDER, 2);
    }
    if (status.soc >= 30) {
    	GUI_FillRoundedRect(MTB_E2200CS021_DISPLAY_SIZE_X - MAIN_SYMBOL_SIZE_X,
    						MTB_E2200CS021_DISPLAY_SIZE_Y - MAIN_SYMBOL_SIZE_BORDER - (MAIN_SYMBOL_SIZE_Y / 5) * 2,
							MTB_E2200CS021_DISPLAY_SIZE_X - MAIN_SYMBOL_SIZE_BORDER - MAIN_SYMBOL_SIZE_BORDER,
							MTB_E2200CS021_DISPLAY_SIZE_Y - MAIN_SYMBOL_SIZE_BORDER - MAIN_SYMBOL_SIZE_BORDER - (MAIN_SYMBOL_SIZE_Y / 5), 2);
    }
    if (status.soc >= 50) {
    	GUI_FillRoundedRect(MTB_E2200CS021_DISPLAY_SIZE_X - MAIN_SYMBOL_SIZE_X,
    						MTB_E2200CS021_DISPLAY_SIZE_Y - MAIN_SYMBOL_SIZE_BORDER - (MAIN_SYMBOL_SIZE_Y / 5) * 3,
							MTB_E2200CS021_DISPLAY_SIZE_X - MAIN_SYMBOL_SIZE_BORDER - MAIN_SYMBOL_SIZE_BORDER,
							MTB_E2200CS021_DISPLAY_SIZE_Y - MAIN_SYMBOL_SIZE_BORDER - MAIN_SYMBOL_SIZE_BORDER - (MAIN_SYMBOL_SIZE_Y / 5) * 2, 2);
    }
    if (status.soc >= 70) {
    	GUI_FillRoundedRect(MTB_E2200CS021_DISPLAY_SIZE_X - MAIN_SYMBOL_SIZE_X,
    						MTB_E2200CS021_DISPLAY_SIZE_Y - MAIN_SYMBOL_SIZE_BORDER - (MAIN_SYMBOL_SIZE_Y / 5) * 4,
							MTB_E2200CS021_DISPLAY_SIZE_X - MAIN_SYMBOL_SIZE_BORDER - MAIN_SYMBOL_SIZE_BORDER,
							MTB_E2200CS021_DISPLAY_SIZE_Y - MAIN_SYMBOL_SIZE_BORDER - MAIN_SYMBOL_SIZE_BORDER - (MAIN_SYMBOL_SIZE_Y / 5) * 3, 2);
    }
    if (status.soc >= 90) {
    	GUI_FillRoundedRect(MTB_E2200CS021_DISPLAY_SIZE_X - MAIN_SYMBOL_SIZE_X,
    						MTB_E2200CS021_DISPLAY_SIZE_Y - MAIN_SYMBOL_SIZE_BORDER - (MAIN_SYMBOL_SIZE_Y / 5) * 5,
							MTB_E2200CS021_DISPLAY_SIZE_X - MAIN_SYMBOL_SIZE_BORDER - MAIN_SYMBOL_SIZE_BORDER,
							MTB_E2200CS021_DISPLAY_SIZE_Y - MAIN_SYMBOL_SIZE_BORDER - MAIN_SYMBOL_SIZE_BORDER - (MAIN_SYMBOL_SIZE_Y / 5) * 4, 2);
    }

    // Increment execution counter
    executionCounter++;
}

/******************************************************************************/
void show_detail_page(EPD_E2200CS021_status_t status) {
	static uint8_t executionCounter;

