Infineon/IMR_PSoC6_BMS/proj_cm0p/PSoC6_BMS_EPD_ScreenConfig.c
	status.error_map = UINT32_MAX;

	/* Draw Top - Show Up-Time for Charging/Discharging */
	GUI_SetColor(GUI_BLACK);
	GUI_SetBkColor(GUI_WHITE);

	GUI_SetFont(GUI_FONT_24B_1);
    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_GotoXY(	MAIN_SYMBOL_SIZE_BORDER, MAIN_TEXT_TOP_LOCATION_1);

    switch(status.OUTPUT_Status) {
        	case OUTPUT_OFF:
        	   	GUI_DispString("OFF");
        	   	break;
        	case OUTPUT_READY:
            	GUI_DispString("READY");
            	break;
            case OUTPUT_OFF_TILL_RESTART:
            	GUI_DispString("INACTIVE");
            	break;
            case OUTPUT_PRECHARGE:
            	GUI_DispString("PRECHARGE");
            	break;
        	case OUTPUT_ON:
        	    GUI_DispDec(status.Active_Hours, 2);
        	    GUI_DispString(":");
        	    GUI_DispDec(status.Active_Minutes, 2);
        	    GUI_DispString(":");
        	    GUI_DispDec(status.Active_Seconds, 2);
            	break;
    }

	/* Draw First Information Line - Show Battery SOC & SOH */
	GUI_SetFont(GUI_FONT_16B_1);
    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_GotoXY(	MAIN_SYMBOL_SIZE_BORDER, 	MAIN_TEXT_BOT_LOCATION_1);
    GUI_DispString("SOC:");

    GUI_GotoXY(	MTB_E2200CS021_DISPLAY_SIZE_X_QUARTER + 10, 	MAIN_TEXT_BOT_LOCATION_1);
    GUI_SetTextAlign(GUI_TA_RIGHT | GUI_TA_VCENTER);
    GUI_DispDecSpace(status.soc, 3);

    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_DispString("%  ");
    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_DispString("SOH:");

    GUI_GotoXY(	MTB_E2200CS021_DISPLAY_SIZE_X_HALF + 33, 	MAIN_TEXT_BOT_LOCATION_1);
    GUI_SetTextAlign(GUI_TA_RIGHT | GUI_TA_VCENTER);
    GUI_DispDecSpace(status.soh, 3);

    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_DispString("%   ");

	/* Draw Second Information Line - Show Battery Voltage*/
	GUI_SetFont(GUI_FONT_16B_1);
    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_GotoXY(	MAIN_SYMBOL_SIZE_BORDER, 	MAIN_TEXT_BOT_LOCATION_2);
    GUI_DispString("Voltage:");

    GUI_SetTextAlign(GUI_TA_RIGHT | GUI_TA_VCENTER);
    GUI_GotoXY(	MTB_E2200CS021_DISPLAY_SIZE_X_HALF, 	MAIN_TEXT_BOT_LOCATION_2);
    GUI_DispFloatMin((float) status.voltage_data / 1000, 2);

    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_DispString(" V");

	/* Draw Third Information Line - Show Battery Current Or Error Code */
	GUI_SetFont(GUI_FONT_16B_1);
    GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
    GUI_GotoXY(	MAIN_SYMBOL_SIZE_BORDER, 	MAIN_TEXT_BOT_LOCATION_3);
    if(sh_pub_error_map_cm0 == 0){
		GUI_DispString("Current:");

		GUI_SetFont(GUI_FONT_16B_1);
		GUI_SetTextAlign(GUI_TA_RIGHT | GUI_TA_VCENTER);
		GUI_GotoXY(	MTB_E2200CS021_DISPLAY_SIZE_X_HALF, 	MAIN_TEXT_BOT_LOCATION_3);
		//////GUI_DispDecSpace(current_data, 3);
		GUI_DispFloatMin((float) status.current_data / 1000, 2);
		//GUI_DispString("-");

		GUI_SetTextAlign(GUI_TA_LEFT | GUI_TA_VCENTER);
		GUI_DispString(" A");
    }
    else{
    	// Display error code and strings
    	uint8_t numErrors = countSetBits(status.error_map);
		GUI_DispString("Error: 0x");
		GUI_DispHex(status.error_map, 8);
		GUI_GotoXY(	MAIN_SYMBOL_SIZE_BORDER, 	MAIN_TEXT_BOT_LOCATION_4);
		print_DispErrors(status.error_map, numErrors, 6);
    }

    // Increment execution counter
    executionCounter++;
}

/******************************************************************************/
EPD_E2200CS021_pages_t show_page(EPD_E2200CS021_pages_t page) {
	// Clear the current screen buffer
	clear_screen();

	// Update data object for display
	EPD_Status_Obj.OUTPUT_Status = sh_pub_outputState_cm0;
	EPD_Status_Obj.SLOT_Status   = sh_pub_slotState_cm0;
	EPD_Status_Obj.error_map = sh_pub_error_map_cm0;
	EPD_Status_Obj.soc = sh_pub_soc_cm0;
	EPD_Status_Obj.soh = sh_pub_soh_cm0;
	EPD_Status_Obj.voltage_data = sh_pub_volt_cm0;
	EPD_Status_Obj.current_data = sh_pub_current_cm0;

	// Lock public access during refresh
	switch (page) {
		case EPD_MainScreen:
			show_top_legend("BMS Monitoring", (EPD_E2200CS021_pages_t) page);
			show_main_page(EPD_Status_Obj);

			return EPD_MainScreen;
			break;
		case EPD_Battery_Page1:
			show_top_legend("Battery Page 1", (EPD_E2200CS021_pages_t) page);
			show_battery_page(1, sh_pub_cells_cm0);

			return EPD_Battery_Page1;
			break;
		case EPD_Battery_Page2:
			show_top_legend("Battery Page 2", (EPD_E2200CS021_pages_t) page);
			show_battery_page(5, sh_pub_cells_cm0);

			return EPD_Battery_Page2;
			break;
		case EPD_Battery_Page3:
			show_top_legend("Battery Page 3", (EPD_E2200CS021_pages_t) page);
			show_battery_page(9, sh_pub_cells_cm0);

			return EPD_Battery_Page3;
			break;
		case EPD_DetailScreen:
			show_top_legend("Detail Page", (EPD_E2200CS021_pages_t) page);
			EPD_Status_Obj.OUTPUT_Status = sh_pub_outputState_cm0;
			EPD_Status_Obj.SLOT_Status   = sh_pub_slotState_cm0;

			show_detail_page(EPD_Status_Obj);

			return EPD_DetailScreen;
			break;
		default:
			return 0;
			break;
	}

	return 0;
}

/******************************************************************************/
uint8_t print_DispErrors(uint32_t error_map, uint8_t numErrors, uint8_t maxErrorsPerLine){
	uint8_t numShownErrors = 0;
	// Priority errors		----------------------
	if((error_map & ERR_INT_TLE9012_QUEUE_FAILED) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("IQF"); }
		else				   { GUI_DispString(",IQF"); }
		numShownErrors++;
	}
	if((error_map & ERR_INT_TLE9012_COM_ERROR) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("ICE"); }
		else				   { GUI_DispString(",ICE"); }
		numShownErrors++;
	}
	if((error_map & ERR_INT_OVERCURRENT) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("IOC"); }
		else				   { GUI_DispString(",IOC"); }
		numShownErrors++;
	}
	if((error_map & ERR_INT_SWITCH_ON_VETO_RECEIVED) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("ISV"); }
		else				   { GUI_DispString(",ISV"); }
		numShownErrors++;
	}
	if((error_map & ERR_INT_ADC_COM_TIMEOUT) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("IAT"); }
		else				   { GUI_DispString(",IAT"); }
		numShownErrors++;
	}
	if((error_map & ERR_INT_VBAT_OV) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("IOV"); }
		else				   { GUI_DispString(",IOV"); }
		numShownErrors++;
	}
	if((error_map & ERR_INT_VBAT_UV) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("IUV"); }
		else				   { GUI_DispString(",IUV"); }
		numShownErrors++;
	}


	// Cell errors		----------------------
	if((error_map & ERR_CAF_OL_ERR) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("COL"); }
		else				   { GUI_DispString(",COL"); }
		numShownErrors++;
	}
	if((error_map & ERR_CAF_CELL_UV) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("CUV"); }
		else				   { GUI_DispString(",CUV"); }
		numShownErrors++;
	}
	if((error_map & ERR_CAF_CELL_OV) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("COV"); }
		else				   { GUI_DispString(",COV"); }
		numShownErrors++;
	}


