Infineon/IMR_PSoC6_BMS/proj_cm0p/PSoC6_BMS_EPD_ScreenConfig.c
	// Medium importance system errors		----------------------
	if((error_map & ERR_CAF_EXT_T_ERR) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("COT"); }
		else				   { GUI_DispString(",COT"); }
		numShownErrors++;
	}
	if((error_map & ERR_CAF_INT_OT) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("FOT"); }
		else				   { GUI_DispString(",FOT"); }
		numShownErrors++;
	}
	if((error_map & ERR_CAF_BAL_UC) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("BUC"); }
		else				   { GUI_DispString(",BUC"); }
		numShownErrors++;
	}
	if((error_map & ERR_CAF_BAL_OC) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("BOC"); }
		else				   { GUI_DispString(",BOC"); }
		numShownErrors++;
	}
	if((error_map & ERR_CAF_PS_SLEEP) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("FPS"); }
		else				   { GUI_DispString(",FPS"); }
		numShownErrors++;
	}
	if((error_map & ERR_CAF_ADC_ERR) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("FAD"); }
		else				   { GUI_DispString(",FAD"); }
		numShownErrors++;
	}

	// Medium importance driver/safety switch errors		----------------------
	if((error_map & ERR_SSW_OVERCURRENT) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("SOC"); }
		else				   { GUI_DispString(",SOC"); }
		numShownErrors++;
	}
	if((error_map & ERR_SSW_SAVESTATE_ENABLED) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("SSS"); }
		else				   { GUI_DispString(",SSS"); }
		numShownErrors++;
	}
	if((error_map & ERR_SSW_VBAT_UNDERVOLTAGE) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("SUV"); }
		else				   { GUI_DispString(",SUV"); }
		numShownErrors++;
	}
	if((error_map & ERR_SSW_VDD_UNDERVOLTAGE) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("SVD"); }
		else				   { GUI_DispString(",SVD"); }
		numShownErrors++;
	}
	if((error_map & ERR_SSW_VBAT_OVERVOLTAGE) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("SOV"); }
		else				   { GUI_DispString(",SOV"); }
		numShownErrors++;
	}
	if((error_map & ERR_SSW_CHIP_OVERTEMPERATURE) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("SOT"); }
		else				   { GUI_DispString(",SOT"); }
		numShownErrors++;
	}

	// Remaining low importance errors
	if((error_map & ERR_CAF_INT_IC_ERR) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("FIC"); }
		else				   { GUI_DispString(",FIC"); }
		numShownErrors++;
	}
	if((error_map & ERR_CAF_REG_CRC_ERR) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("FCE"); }
		else				   { GUI_DispString(",FCE"); }
		numShownErrors++;
	}
	if((error_map & ERR_SSW_VDS_OVERVOLTAGE_A) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("SAO"); }
		else				   { GUI_DispString(",SAO"); }
		numShownErrors++;
	}
	if((error_map & ERR_SSW_VGS_UNDERVOLTAGE_A) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("SAU"); }
		else				   { GUI_DispString(",SAU"); }
		numShownErrors++;
	}
	if((error_map & ERR_SSW_VDS_OVERVOLTAGE_B) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("SBO"); }
		else				   { GUI_DispString(",SBO"); }
		numShownErrors++;
	}
	if((error_map & ERR_SSW_VGS_UNDERVOLTAGE_B) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("SBU"); }
		else				   { GUI_DispString(",SBU"); }
		numShownErrors++;
	}
	if((error_map & ERR_SSW_CHARGEPUMP_UNDERVOLTAGE) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("SCU"); }
		else				   { GUI_DispString(",SCU"); }
		numShownErrors++;
	}

	// Show interrupt errors
	if((error_map & ERR_SSW_INTERRUPT) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("SI"); }
		else				   { GUI_DispString(",SI"); }
		numShownErrors++;
	}
	if((error_map & ERR_CAF_TLE9012_INTERRUPT) && numShownErrors < maxErrorsPerLine){
		if(numShownErrors == 0){ GUI_DispString("FI"); }
		else				   { GUI_DispString(",FI"); }
		numShownErrors++;
	}

	// If there where more errors than can be shown signalizes it by adding dots
	if(numErrors > maxErrorsPerLine){ GUI_DispString("..."); }

	// Return the number of shown errors
	return numShownErrors;
}

// Function to get number of set bits in binary representation of positive integer n
// https://www.geeksforgeeks.org/count-set-bits-in-an-integer/
uint8_t countSetBits(uint32_t n){
    uint8_t count = 0;
    while (n) {
        count += n & 1;
        n >>= 1;
    }
    return count;
}

//****************************************************************************
// mapRangeToScale - Converts a range of numbers to a percentage scale
// n       number to convert
// lRange  lowest number of the range
// hRange  highest number in the range
// scale   percentage scale
//****************************************************************************
float mapRangeToScale(float n, float lRange, float hRange, float scale){
	// Input validation
	//if (n < lRange || n > hRange) { return -1.0; }

	// Map to scale
	float result = (n - lRange)/(hRange - lRange) * scale;

	// Return
	if(result < 0)
		return 0;
	else if(result > 100)
		return 100;
	else
		return result;
}

/******************************************************************************/
/* [] END OF FILE */

